results_petclinic-sim-native/run_5_2026-01-05_03-43-42/FIXED-3000-latency-1-dump.txt
Running 30s test @ http://127.0.0.1:8006
  16 threads and 16 connections
  Thread calibration: mean lat.: 5.857ms, rate sampling interval: 22ms
  Thread calibration: mean lat.: 5.659ms, rate sampling interval: 21ms
  Thread calibration: mean lat.: 5.904ms, rate sampling interval: 21ms
  Thread calibration: mean lat.: 5.940ms, rate sampling interval: 20ms
  Thread calibration: mean lat.: 6.456ms, rate sampling interval: 24ms
  Thread calibration: mean lat.: 6.348ms, rate sampling interval: 25ms
  Thread calibration: mean lat.: 6.570ms, rate sampling interval: 28ms
  Thread calibration: mean lat.: 5.486ms, rate sampling interval: 19ms
  Thread calibration: mean lat.: 6.138ms, rate sampling interval: 24ms
  Thread calibration: mean lat.: 6.027ms, rate sampling interval: 25ms
  Thread calibration: mean lat.: 5.568ms, rate sampling interval: 23ms
  Thread calibration: mean lat.: 5.763ms, rate sampling interval: 21ms
  Thread calibration: mean lat.: 5.772ms, rate sampling interval: 20ms
  Thread calibration: mean lat.: 6.053ms, rate sampling interval: 23ms
  Thread calibration: mean lat.: 6.292ms, rate sampling interval: 24ms
  Thread calibration: mean lat.: 6.257ms, rate sampling interval: 24ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     4.99ms    4.60ms  63.14ms   91.09%
    Req/Sec   191.51     45.51   526.00     79.73%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    3.59ms
 75.000%    5.38ms
 90.000%    9.05ms
 99.000%   27.31ms
 99.900%   42.17ms
 99.990%   54.05ms
 99.999%   60.22ms
100.000%   63.17ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.865     0.000000            1         1.00
       2.105     0.100000         6012         1.11
       2.469     0.200000        12026         1.25
       2.803     0.300000        18016         1.43
       3.163     0.400000        24019         1.67
       3.587     0.500000        30010         2.00
       3.839     0.550000        32992         2.22
       4.127     0.600000        35998         2.50
       4.471     0.650000        39005         2.86
       4.867     0.700000        42003         3.33
       5.383     0.750000        44976         4.00
       5.715     0.775000        46482         4.44
       6.111     0.800000        47985         5.00
       6.615     0.825000        49479         5.71
       7.207     0.850000        50980         6.67
       8.015     0.875000        52472         8.00
       8.503     0.887500        53223         8.89
       9.047     0.900000        53982        10.00
       9.679     0.912500        54719        11.43
      10.471     0.925000        55471        13.33
      11.407     0.937500        56223        16.00
      11.967     0.943750        56594        17.78
      12.671     0.950000        56973        20.00
      13.551     0.956250        57345        22.86
      14.575     0.962500        57718        26.67
      16.023     0.968750        58095        32.00
      16.847     0.971875        58281        35.56
      17.887     0.975000        58470        40.00
      19.135     0.978125        58657        45.71
      20.767     0.981250        58843        53.33
      22.719     0.984375        59032        64.00
      23.919     0.985938        59123        71.11
      25.023     0.987500        59217        80.00
      26.591     0.989062        59311        91.43
      27.791     0.990625        59404       106.67
      29.535     0.992188        59498       128.00
      30.431     0.992969        59547       142.22
      31.375     0.993750        59593       160.00
      32.239     0.994531        59639       182.86
      33.119     0.995313        59685       213.33
      34.207     0.996094        59733       256.00
      34.751     0.996484        59756       284.44
      35.391     0.996875        59780       320.00
      36.319     0.997266        59804       365.71
      37.183     0.997656        59826       426.67
      38.527     0.998047        59849       512.00
      39.135     0.998242        59861       568.89
      39.967     0.998437        59873       640.00
      40.543     0.998633        59886       731.43
      41.343     0.998828        59896       853.33
      42.207     0.999023        59909      1024.00
      42.719     0.999121        59914      1137.78
      43.359     0.999219        59920      1280.00
      43.903     0.999316        59926      1462.86
      45.055     0.999414        59931      1706.67
      45.951     0.999512        59937      2048.00
      46.815     0.999561        59940      2275.56
      47.487     0.999609        59943      2560.00
      48.351     0.999658        59946      2925.71
      49.823     0.999707        59949      3413.33
      50.783     0.999756        59952      4096.00
      50.815     0.999780        59953      4551.11
      51.999     0.999805        59955      5120.00
      52.383     0.999829        59956      5851.43
      53.055     0.999854        59958      6826.67
      53.151     0.999878        59959      8192.00
      54.047     0.999890        59960      9102.22
      55.647     0.999902        59961     10240.00
      55.647     0.999915        59961     11702.86
      56.063     0.999927        59962     13653.33
      57.247     0.999939        59963     16384.00
      57.247     0.999945        59963     18204.44
      58.687     0.999951        59964     20480.00
      58.687     0.999957        59964     23405.71
      58.687     0.999963        59964     27306.67
      60.223     0.999969        59965     32768.00
      60.223     0.999973        59965     36408.89
      60.223     0.999976        59965     40960.00
      60.223     0.999979        59965     46811.43
      60.223     0.999982        59965     54613.33
      63.167     0.999985        59966     65536.00
      63.167     1.000000        59966          inf
#[Mean    =        4.986, StdDeviation   =        4.601]
#[Max     =       63.136, Total count    =        59966]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  89998 requests in 30.00s, 134.13MB read
Requests/sec:   2999.95
Transfer/sec:      4.47MB